# encoding: utf-8
import const as ct
from cstock_info import CStockInfo
with open('/tmp/a', 'r') as f:
    out = f.read()
adict = {
    '300269': '财务造假',
    '600267': '财务造假',
    '600598': '财务造假',
    '002763': '董事长内幕交易，监管部门公开谴责',
    '002763': '财务造假，监管部门公开谴责',
    '601519': '利润跨期调整',
    '000691': '亚太实业：虚增收入',
    '000922': '佳电股份：财务造假',
    '601777': '力帆股份：虚增利润，大股东质押85％，主业亏损，2017年利润由房地产价值变动支撑',
    '002574': '明牌珠宝：跨行业并购失败，毛利润很低',
    '300267': '尔康制药：财务造假',
    '000636': '风华高科：财务造假，立案调查',
    '300056': '三维丝：财务猫腻，年报无法表示意见',
    '300043': '星辉娱乐：乱搞并购，虚增利润',
    '601808': '中海油服：16年大幅资产减值，净利暴跌114亿，现金流持续下滑',
    '000933': '神火股份：16年大幅资产减值，净利暴跌10亿',
    '000933': '安源煤业：16年大幅资产减值，净利暴跌20亿',
    '601106': 'st一重：16年大幅资产减值，净利暴跌57亿',
    '601558': '华锐风电：寅吃卯粮，提前确认收入，16年大幅资产减值，净利暴跌24亿',
    '002180': '纳思达：16年跨国并购，年年并购巨额商誉',
    '002181': '粤传媒：并购对象造假破产',
    '600165': '新日恒力：经营现金流持续为负，并购不利，商誉巨额减值',
    '002312': '三泰控股：并购不利，商誉巨额减值，现金流持续为负，苟延残喘',
    '600594': '益佰制药：商誉虚值该减不减',
    '603169': '兰石重装：无优质资产，经营现金流非常差，靠融资续命',
    '002333': '罗普金斯：铝型材的生产销售，行业竞争加剧，上市八年主营无增长，连续三年扣非净利润亏损，经营现金流持续为负',
    '300362': '天翔环境：近年负债率持续攀升，高负债经营，亏损严重，现金流严重不足，控股股东存在非经营性资金占用，到期债务未能偿还',
    '002464': '众应互联：商誉占比总资产超60％',
    '002759': '天际股份：商誉占比总资产超60％',
    '002188': '巴士在线：商誉占比总资产超60％',
    '002971': '高升控股：商誉占比总资产超60％，大股东全部质押，质押套现20亿用于偿还债务',
    '002354': '天神娱乐：商誉66亿，占比总资产超60％，现金流很差',
    '600721': '百花村：商誉占比总资产超60％',
    '002247': '帝龙文化：商誉占比总资产超60％',
    '002113': '天润数娱：商誉占比总资产超60％',
}

cs = CStockInfo(ct.OUT_DB_INFO, redis_host = '127.0.0.1')
info = cs.get(redis = cs.redis)
info = info[['code', 'name']]
for row in out.split():
    reasons = row.split('：')
    name    = reasons[0]
    code_list = info[info.name == name].code.tolist()
    if len(code_list) > 0:
        adict[code_list[0]] = row

import json
jsonDumpsIndentStr = json.dumps(adict, indent=1, ensure_ascii=False)

print(jsonDumpsIndentStr)
